In [2]:
import pandas as pd
import numpy as np

In [20]:
arr = np.array([[10,20,np.nan],[5,np.nan,23],[21,np.nan,10]])

In [21]:
df = pd.DataFrame(arr,index=["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [22]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN     23.0
Index3     21.0      NaN     10.0

In [23]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [24]:
df.dropna(axis=1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [32]:
df.dropna(axis=1,thresh=1)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN     23.0
Index3     21.0      NaN     10.0

In [33]:
df.isnull().sum().sum()

3

In [34]:
def calculateMean(df):
    totalSum = df.sum().sum()
    totalNum = df.size - df.isnull().sum().sum()
    return totalSum / totalNum

df.fillna(value = calculateMean(df))

        Column1    Column2    Column3
Index1     10.0  20.000000  14.833333
Index2      5.0  14.833333  23.000000
Index3     21.0  14.833333  10.000000